Revit 2027 API
ParameterTypeId.PathReinShapen1 Property
 "Primary Bar - Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinShapen1 { get; }
Public Shared ReadOnly Property PathReinShapen1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinShapen1 {
	ForgeTypeId^ get ();
}
static member PathReinShapen1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace